# The aim of the project is to aggregate the Nigeria car dataset to answer the following questions
* What is the most expensive Automatic car (show car name and model make) with a mileage of less than 50000.
* Which car make has the highest average price? 
* Select the row with a price at the 76th percentile score.
 
## The dataset was gotten from this link below:[link](https://www.kaggle.com/datasets/segunadedipe/nigerian-car-prices)

In [1]:
#importing the necessary libraries
import pandas as pd
import seaborn as sns
import matplotlib 
from matplotlib import pyplot as plt
import numpy as np

In [2]:
car_df=pd.read_csv('Nigerian_Car_Prices.csv')#read in the dataset as a pandas dataframe

In [3]:
car_df.head()#visualizing first 5 rows of the dataset

,Unnamed: 0,Make,Year of manufacture,Condition,Mileage,Engine Size,Fuel,Transmission,Price,Build
0,0,Toyota,2007.0,Nigerian Used,166418.0,2400.0,Petrol,Automatic,"3,120,000",NaN
1,1,Lexus,NaN,NaN,138024.0,NaN,NaN,Automatic,"5,834,000",NaN
2,2,Mercedes-Benz,2008.0,Nigerian Used,376807.0,3000.0,Petrol,Automatic,"3,640,000",NaN
3,3,Lexus,NaN,NaN,213362.0,NaN,NaN,Automatic,"3,594,000",NaN
4,4,Mercedes-Benz,NaN,NaN,106199.0,NaN,NaN,Automatic,"8,410,000",NaN

## The data cleaning stage

In [3]:
#The column names with spaces in between them are changed to underscore
new_columns=[]
for i in car_df.columns:
    if ' ' in i:
        colums=i.replace(' ','_')
        new_columns.append(colums)
    else:
        new_columns.append(i)
new_columns

['Unnamed:_0',
 'Make',
 'Year_of_manufacture',
 'Condition',
 'Mileage',
 'Engine_Size',
 'Fuel',
 'Transmission',
 'Price',
 'Build']

In [4]:
car_df.columns=new_columns#the dataset column name is changed to the new column names
car_df.columns

Index(['Unnamed:_0', 'Make', 'Year_of_manufacture', 'Condition', 'Mileage',
       'Engine_Size', 'Fuel', 'Transmission', 'Price', 'Build'],
      dtype='object')

In [6]:
car_df.shape

(4095, 10)

In [7]:
car_df.describe()

        Unnamed:_0  Year_of_manufacture       Mileage    Engine_Size
count  4095.000000          3617.000000  4.024000e+03    3584.000000
mean   2047.000000          2007.898535  1.825337e+05    3274.976562
std    1182.269005             4.300126  2.109233e+05    7693.489588
min       0.000000          1992.000000  1.000000e+00       3.000000
25%    1023.500000          2005.000000  1.020640e+05    2000.000000
50%    2047.000000          2008.000000  1.613525e+05    2500.000000
75%    3070.500000          2011.000000  2.319522e+05    3500.000000
max    4094.000000          2021.000000  9.976050e+06  371000.000000

In [8]:
car_df.isnull().sum()#This shows that some columns has some missing or null values

Unnamed:_0                0
Make                      0
Year_of_manufacture     478
Condition               479
Mileage                  71
Engine_Size             511
Fuel                    488
Transmission             20
Price                     0
Build                  2968
dtype: int64

In [9]:
car_df['Year_of_manufacture'].fillna(0,inplace=True)#the missing values in year of manufacture column is filled with Zero

In [10]:
car_df['Condition'].fillna('None',inplace=True)#the missing values in Condition column is filled with none

In [11]:
car_df['Mileage'].fillna(car_df['Mileage'].mean(),inplace=True)#the missing values in Mileage column is filled with the mean value of the column

In [12]:
car_df.dtypes #checks the type of each column in the dataframe

Unnamed:_0               int64
Make                    object
Year_of_manufacture    float64
Condition               object
Mileage                float64
Engine_Size            float64
Fuel                    object
Transmission            object
Price                   object
Build                   object
dtype: object

In [5]:
#replace the , in the price column with no space
new_price=[]
for i in car_df['Price']:
    new_i=int(i.replace(',',''))
    new_price.append(new_i)

In [15]:
#assign new_price back to price column
car_df['Price']= new_price
car_df['Price'].dtype

dtype('int64')

##  What is the most expensive Automatic car (show car name and model make) with a mileage of less than 50000.

In [26]:
#The code shows the price of the most expensive automatic car with mileage less than 50000 
car_df.query('Transmission == "Automatic" & Mileage < 50000')['Price'].max()

58800000

In [35]:
# Returning the car name and model make with the price of 58800000
car_df.query('Price== 58800000')[['Make','Transmission','Build']]

              Make Transmission Build
377  Mercedes-Benz    Automatic   SUV
424  Mercedes-Benz    Automatic   SUV

## Which car make has the highest average price?

In [80]:
car_mean=car_df.pivot_table(index='Make',values='Price')#returns the mean price of  each car make
mask= (car_mean==car_mean.to_numpy().max()).any(1)#Check whether each element is equal to the maximum value of its column
res=car_mean[mask]#filters the car_mean dataframe to return row with the maximum price
res

           Price
Make
Tata  17850000.0

## Select the row with a price at the 76th percentile score.

In [73]:
#The price at the 76th percentile
car_df['Price'].quantile(0.76)

4770000.0

In [71]:
#the rows with the 76th percentile
car_df.query('Price == 4770000')

,Unnamed:_0,Make,Year_of_manufacture,Condition,Mileage,Engine_Size,Fuel,Transmission,Price,Build
576,576,Buick,0.0,None,55388.0,NaN,NaN,Automatic,4770000,NaN
679,679,Buick,0.0,None,55388.0,NaN,NaN,Automatic,4770000,NaN